# =============================
# Tap and prerequisites
# =============================

tap "homebrew/cask"

# =============================
# Command Line Tools
# =============================

brew "git"
brew "python3"
brew "openjdk"
brew "maven"
brew "node"
brew "npm"
brew "nvm"
brew "fzf"
brew "htop"
brew "wget"
brew "curl"
brew "tmux"
brew "neofetch"
brew "bat"
brew "jq"
brew "tree"
brew "watch"
brew "tldr"
brew "azure-cli"
brew "docker"
brew "docker-compose"
brew "mas"

# =============================
# GUI Applications
# =============================

## Install Homebrew Cask applications
cask "vlc"
cask "slack"
cask "firefox"
cask "google-chrome"
cask "ngrok"
cask "macs-fan-control"
cask "dotnet"
cask "visual-studio-code"
cask "rider"
cask "intellij-idea"
cask "jetbrains-toolbox"
cask "postman"
cask "private-internet-access"
cask "iterm2"
cask "go2shell"
cask "monitorcontrol"
cask "microsoft-teams"
cask "font-fira-code"

## Install Mac App Store applications
# 'mas install' requires the app id, which can be found by running 'mas search <app_name>'
mas "The Unarchiver", id: 425424353
mas "Slack", id: 803453959
mas "Microsoft Teams", id: 1417478133
mas "Microsoft OneDrive", id: 823766827 
mas "Magnet", id: 441258766

## Install Visual Studio Code extensions
# 'vscode --install-extension' requires the extension id, which can be found by running 'code --list-extensions'
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.csdevkit"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-docker"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-playwright.playwright"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "yzhang.markdown-all-in-one"
vscode "streetsidesoftware.code-spell-checker"



