# =============================
# Tap and prerequisites
# =============================

tap "homebrew/bundle"       # Enables Brewfile support
tap "homebrew/cask"         # For installing GUI apps

# =============================
# Fonts
# =============================

cask "font-fira-code"      # Fira Code font for programming
cask "font-fira-mono"      # Fira Mono font for terminal
cask "font-jetbrains-mono"  # JetBrains Mono font for programming
cask "font-roboto-mono"     # Roboto Mono font for programming
cask "font-source-code-pro" # Source Code Pro font for programming
cask "font-meslo-lg-nerd-font" # MesloLGS NF font for terminal

# =============================
# Command Line Tools
# =============================

brew "git"                 # Version control system
brew "python3"             # Python 3 for scripting and development
brew "openjdk"             # OpenJDK for Java development
brew "maven"               # Apache Maven for Java project management
brew "node"                # Node.js runtime
brew "npm"                 # Node Package Manager
brew "nvm"                 # Node Version Manager
brew "fzf"                 # Fuzzy finder for command line
brew "htop"                # Interactive process viewer
brew "wget"                # Download files from the web
brew "curl"                # Transfer data with URLs
brew "tmux"                # Terminal multiplexer
brew "neofetch"            # Fetch system information
brew "bat"                 # Modern replacement for `cat` with syntax highlighting
brew "jq"                  # Command-line JSON processor
brew "tree"                # Display directory structure as a tree
brew "watch"               # Run a command at regular intervals
brew "tldr"                # Simplified man pages from the community
brew "azure-cli"           # Azure CLI for managing Azure resources
brew "docker"              # Docker for containerization
brew "docker-compose"      # Manage multi-container Docker apps
brew "mas"                 # Mac App Store CLI
brew "gh"                  # GitHub CLI for managing GitHub repositories
# brew "exa"                 # Modern replacement for `ls` with icons and colors

# =============================
# GUI Applications
# =============================

## Install Homebrew Cask applications
cask "vlc" # VLC media player for playing various media formats
cask "slack" # Slack for team communication
cask "firefox" # Firefox web browser
cask "google-chrome"
cask "ngrok"
cask "macs-fan-control"
cask "dotnet"
cask "visual-studio-code"
cask "rider"
# cask "intellij-idea"
cask "jetbrains-toolbox"
cask "postman"
cask "private-internet-access"
cask "iterm2"
cask "go2shell"
cask "monitorcontrol"
cask "hammerspoon"
# cask "nikitabobko/tap/aerospace"

## Install Mac App Store applications
# 'mas install' requires the app id, which can be found by running 'mas search <app_name>'
# mas "The Unarchiver", id: 425424353
# mas "Slack", id: 803453959
# mas "Microsoft Teams", id: 1417478133
# mas "Microsoft OneDrive", id: 823766827 
mas "Magnet", id: 441258766

## Install Visual Studio Code extensions
# 'vscode --install-extension' requires the extension id, which can be found by running 'code --list-extensions'
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.csdevkit"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-docker"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-playwright.playwright"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "yzhang.markdown-all-in-one"
vscode "streetsidesoftware.code-spell-checker"
vscode "ionide.ionide-fsharp"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.azure-account"
vscode "sharat.vscode-brewfile"
vscode "adrianwilczynski.csharp-to-typescript"
vscode "ms-vscode-remote.remote-containers"